10/data/attachments/328ad00a03fe6e0c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Victoria_as_Friend_93123_4</nif:username>
            <nif:friendToBeRequested>soap_friends_fbe1899d-da72-471c-9ef4-4418cf35f086</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>